Repository: ViffyGwaanl/papertok-reader
Catalog: App/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# common.earlier
source: Earlier
zh_hans: 更早
zh_hant: 更早

# common.full_screen
source: Full Screen
zh_hans: 全屏
zh_hant: 全螢幕

# common.exit_full_screen
source: Exit Full Screen
zh_hans: 退出全屏
zh_hant: 退出全螢幕

# common.minimize
source: Minimize
zh_hans: 最小化
zh_hant: 最小化

# common.enabled
source: Enabled
zh_hans: 已启用
zh_hant: 已啟用

# sync.run_test
source: Run Test
zh_hans: 运行测试
zh_hant: 執行測試

# sync.connection_check.reachability
source: Reachability
zh_hans: 连通性
zh_hant: 連通性

# sync.connection_check.authentication
source: Authentication
zh_hans: 身份验证
zh_hant: 驗證

# sync.connection_check.write_permission
source: Write Permission
zh_hans: 写入权限
zh_hant: 寫入權限

# sync.connection_check.latency
source: Latency
zh_hans: 延迟
zh_hant: 延遲

# sync.connection_check.quota
source: Quota
zh_hans: 配额
zh_hant: 配額

# sync.connection_detail.not_configured
source: Not configured
zh_hans: 未配置
zh_hant: 未設定

# sync.connection_detail.configure_webdav_first
source: Configure WebDAV sync first.
zh_hans: 请先配置 WebDAV 同步。
zh_hant: 請先設定 WebDAV 同步。

# sync.connection_detail.all_passed
source: All checks passed.
zh_hans: 所有检查均已通过。
zh_hant: 所有檢查皆已通過。

# sync.connection_detail.summary_failed
source: %d of %d checks failed
zh_hans: %d/%d 项检查失败
zh_hant: %d/%d 項檢查失敗

# sync.connection_detail.server_reachable
source: Server reachable.
zh_hans: 服务器可访问。
zh_hant: 伺服器可連線。

# sync.connection_detail.reachability_failed_format
source: Reachability check failed: %@
zh_hans: 连通性检查失败：%@
zh_hant: 連通性檢查失敗：%@

# sync.connection_detail.credentials_accepted
source: Credentials accepted.
zh_hans: 凭据验证通过。
zh_hant: 憑證驗證通過。

# sync.connection_detail.auth_failed_format
source: Authentication failed: %@
zh_hans: 身份验证失败：%@
zh_hant: 驗證失敗：%@

# sync.connection_detail.write_ok
source: Write test succeeded.
zh_hans: 写入测试成功。
zh_hant: 寫入測試成功。

# sync.connection_detail.cannot_write_format
source: Write test failed: %@
zh_hans: 写入测试失败：%@
zh_hant: 寫入測試失敗：%@

# sync.connection_detail.latency_probe_failed
source: Latency probe failed.
zh_hans: 延迟探测失败。
zh_hant: 延遲探測失敗。

# sync.connection_detail.latency_average
source: Average latency: %.0f ms (%d probes)
zh_hans: 平均延迟：%.0f 毫秒（%d 次探测）
zh_hant: 平均延遲：%.0f 毫秒（%d 次探測）

# sync.connection_detail.quota_unavailable
source: Quota information unavailable.
zh_hans: 配额信息不可用。
zh_hant: 配額資訊不可用。

# sync.connection_detail.quota_failed_format
source: Quota check failed: %@
zh_hans: 配额检查失败：%@
zh_hant: 配額檢查失敗：%@

# settings.developer.verbose_logging
source: Verbose Logging
zh_hans: 详细日志
zh_hant: 詳細日誌

# settings.developer.network_logging
source: Network Logging
zh_hans: 网络日志
zh_hant: 網路日誌

# settings.developer.slow_animations
source: Slow Animations
zh_hans: 慢速动画
zh_hant: 慢速動畫

# settings.developer.debug_overlay
source: Debug Overlay
zh_hans: 调试叠层
zh_hant: 除錯覆層

# reader.annotation.add
source: Add Annotation
zh_hans: 添加标注
zh_hant: 加入註記

# reader.annotation.edit
source: Edit Annotation
zh_hans: 编辑标注
zh_hant: 編輯註記

# reader.annotation.style.highlight
source: Highlight
zh_hans: 高亮
zh_hant: 高亮

# reader.annotation.style.underline
source: Underline
zh_hans: 下划线
zh_hant: 底線

# reader.annotation.style.strikethrough
source: Strikethrough
zh_hans: 删除线
zh_hant: 刪除線

# errors.calendar.access_denied
source: Calendar access denied. Please grant permission in Settings.
zh_hans: 日历访问被拒绝，请在“设置”中授予权限。
zh_hant: 行事曆存取遭拒，請在「設定」中授予權限。

# errors.calendar.event_not_found_format
source: Event not found: %@
zh_hans: 未找到日历事件：%@
zh_hant: 找不到行事曆事件：%@

# errors.reminders.access_denied
source: Reminders access denied. Please grant permission in Settings.
zh_hans: 提醒事项访问被拒绝，请在“设置”中授予权限。
zh_hant: 提醒事項存取遭拒，請在「設定」中授予權限。

# errors.reminders.not_found_format
source: Reminder not found: %@
zh_hans: 未找到提醒事项：%@
zh_hant: 找不到提醒事項：%@

# intent.open_book.dialog_format
source: Opening "%@"
zh_hans: 正在打开“%@”
zh_hant: 正在打開「%@」

# intent.search_books.error.empty_query
source: Please provide a search query.
zh_hans: 请输入搜索内容。
zh_hant: 請輸入搜尋內容。

# intent.search_books.no_matches_format
source: No books matched "%@".
zh_hans: 没有找到与“%@”匹配的图书。
zh_hant: 沒有找到與「%@」相符的書籍。

# intent.search_books.dialog.results_format
source: Found %d matching books for "%@".
zh_hans: 已为“%@”找到 %d 本图书。
zh_hant: 已為「%@」找到 %d 本書籍。

# intent.get_stats.scope.type
source: Reading Stats Scope
zh_hans: 阅读统计范围
zh_hant: 閱讀統計範圍

# intent.get_stats.summary.reading_time.today_format
source: Reading time: %@ hours today
zh_hans: 阅读时长：%@ 小时（今日）
zh_hant: 閱讀時長：%@ 小時（今日）

# intent.get_stats.summary.reading_time.week_format
source: Reading time: %@ hours this week
zh_hans: 阅读时长：%@ 小时（本周）
zh_hant: 閱讀時長：%@ 小時（本週）

# intent.get_stats.summary.reading_time.month_format
source: Reading time: %@ hours this month
zh_hans: 阅读时长：%@ 小时（本月）
zh_hant: 閱讀時長：%@ 小時（本月）

# intent.get_stats.summary.reading_time.all_format
source: Reading time: %@ hours in total
zh_hans: 累计阅读时长：%@ 小时
zh_hant: 累計閱讀時長：%@ 小時

# intent.get_stats.summary.books_count_format
source: Books in library: %d
zh_hans: 书库图书：%d
zh_hant: 書庫書籍：%d

# intent.get_stats.summary.notes_count_format
source: Notes captured: %d
zh_hans: 已记录笔记：%d
zh_hant: 已記錄筆記：%d

# intent.get_stats.summary.streak_format
source: Current streak: %d days
zh_hans: 当前连续阅读：%d 天
zh_hant: 目前連續閱讀：%d 天

# intent.get_stats.dialog.today_format
source: You have read %@ hours today.
zh_hans: 你今天已阅读 %@ 小时。
zh_hant: 你今天已閱讀 %@ 小時。

# intent.get_stats.dialog.week_format
source: You have read %@ hours this week.
zh_hans: 你本周已阅读 %@ 小时。
zh_hant: 你本週已閱讀 %@ 小時。

# intent.get_stats.dialog.month_format
source: You have read %@ hours this month.
zh_hans: 你本月已阅读 %@ 小时。
zh_hant: 你本月已閱讀 %@ 小時。

# intent.get_stats.dialog.all_format
source: You have read %@ hours in total.
zh_hans: 你累计已阅读 %@ 小时。
zh_hant: 你累計已閱讀 %@ 小時。

# intent.create_note.error.book_not_found_format
source: No book in your PaperTok library matched "%@".
zh_hans: 你的 PaperTok 书库中没有找到“%@”。
zh_hant: 你的 PaperTok 書庫中沒有找到「%@」。

# intent.create_note.summary_format
source: Added note #%1$@ to "%2$@".
zh_hans: 已为“%2$@”添加笔记 #%1$@。
zh_hant: 已為「%2$@」加入筆記 #%1$@。

# intent.create_note.dialog_format
source: Saved note to %@.
zh_hans: 已保存到《%@》的笔记。
zh_hant: 已儲存到《%@》的筆記。

# intent.multi_step.error.missing_parameter_format
source: Missing required parameter: %@
zh_hans: 缺少必填参数：%@
zh_hant: 缺少必要參數：%@

# intent.multi_step.error.step_failed_format
source: Step %@ failed: %@
zh_hans: 步骤 %@ 失败：%@
zh_hant: 步驟 %@ 失敗：%@

# intent.multi_step.error.unsupported_intent_format
source: Unsupported intent: %@
zh_hans: 不支持的快捷指令动作：%@
zh_hant: 不支援的捷徑動作：%@

# intent.shortcut.open_book.phrase.open
source: Open a book in PaperTok Reader
zh_hans: 在 PaperTok Reader 中打开书籍
zh_hant: 在 PaperTok Reader 中打開書籍

# intent.shortcut.open_book.phrase.read
source: Read with PaperTok Reader
zh_hans: 用 PaperTok Reader 阅读
zh_hant: 用 PaperTok Reader 閱讀

# intent.shortcut.ask_ai.phrase.ask
source: Ask PaperTok Reader AI a question
zh_hans: 向 PaperTok Reader AI 提问
zh_hant: 向 PaperTok Reader AI 提問

# intent.shortcut.ask_ai.phrase.chat
source: Chat with PaperTok Reader AI
zh_hans: 与 PaperTok Reader AI 对话
zh_hant: 與 PaperTok Reader AI 對話

# intent.shortcut.send_message.phrase.message
source: Send a message to PaperTok Reader AI
zh_hans: 向 PaperTok Reader AI 发送消息
zh_hant: 向 PaperTok Reader AI 傳送訊息

# intent.shortcut.send_message.phrase.images
source: Send images to PaperTok Reader AI
zh_hans: 向 PaperTok Reader AI 发送图片
zh_hant: 向 PaperTok Reader AI 傳送圖片

# intent.shortcut.search_books.phrase.search
source: Search books in PaperTok Reader
zh_hans: 在 PaperTok Reader 中搜索图书
zh_hant: 在 PaperTok Reader 中搜尋書籍

# intent.shortcut.search_books.phrase.find
source: Find a book in PaperTok Reader
zh_hans: 在 PaperTok Reader 中查找图书
zh_hant: 在 PaperTok Reader 中尋找書籍

# intent.shortcut.get_stats.phrase.stats
source: Get my reading stats from PaperTok Reader
zh_hans: 获取我的 PaperTok Reader 阅读统计
zh_hant: 取得我的 PaperTok Reader 閱讀統計

# intent.shortcut.get_stats.phrase.time
source: Show reading time in PaperTok Reader
zh_hans: 显示我的 PaperTok Reader 阅读时长
zh_hant: 顯示我的 PaperTok Reader 閱讀時長

# intent.shortcut.create_note.phrase.create
source: Create a note in PaperTok Reader
zh_hans: 在 PaperTok Reader 中创建笔记
zh_hant: 在 PaperTok Reader 中建立筆記

# intent.shortcut.create_note.phrase.add
source: Add a book note to PaperTok Reader
zh_hans: 向 PaperTok Reader 添加图书笔记
zh_hant: 向 PaperTok Reader 加入書籍筆記

source: Open a book in ${applicationName}
zh_hans: 在 ${applicationName} 中打开书籍
zh_hant: 在 ${applicationName} 中打開書籍

source: Read with ${applicationName}
zh_hans: 用 ${applicationName} 阅读
zh_hant: 用 ${applicationName} 閱讀

source: Ask ${applicationName} a question
zh_hans: 向 ${applicationName} 提问
zh_hant: 向 ${applicationName} 提問

source: Chat with ${applicationName}
zh_hans: 与 ${applicationName} 对话
zh_hant: 與 ${applicationName} 對話

source: Send a message to ${applicationName}
zh_hans: 向 ${applicationName} 发送消息
zh_hant: 向 ${applicationName} 傳送訊息

source: Send images to ${applicationName}
zh_hans: 向 ${applicationName} 发送图片
zh_hant: 向 ${applicationName} 傳送圖片

source: Search books in ${applicationName}
zh_hans: 在 ${applicationName} 中搜索图书
zh_hant: 在 ${applicationName} 中搜尋書籍

source: Find a book in ${applicationName}
zh_hans: 在 ${applicationName} 中查找图书
zh_hant: 在 ${applicationName} 中尋找書籍

source: Get my reading stats from ${applicationName}
zh_hans: 获取我的 ${applicationName} 阅读统计
zh_hant: 取得我的 ${applicationName} 閱讀統計

source: Show reading time in ${applicationName}
zh_hans: 显示我在 ${applicationName} 的阅读时长
zh_hant: 顯示我在 ${applicationName} 的閱讀時長

source: Create a note in ${applicationName}
zh_hans: 在 ${applicationName} 中创建笔记
zh_hant: 在 ${applicationName} 中建立筆記

source: Add a book note to ${applicationName}
zh_hans: 向 ${applicationName} 添加图书笔记
zh_hant: 向 ${applicationName} 新增書籍筆記

# papers.empty.failed_to_load
source: Failed to Load
zh_hans: 加载失败
zh_hant: 載入失敗

# papers.empty.no_papers
source: No Papers
zh_hans: 暂无论文
zh_hant: 暫無論文

# papers.download.phase.downloading
source: Downloading
zh_hans: 下载中
zh_hant: 下載中

# papers.download.phase.importing
source: Importing
zh_hans: 导入中
zh_hant: 匯入中

# notes.pdf.header.author_format
source: by %@
zh_hans: 作者：%@
zh_hant: 作者：%@

# notes.pdf.header.exported_at_format
source: Exported %@
zh_hans: 导出于 %@
zh_hant: 匯出於 %@

# notes.pdf.footer.page_format
source: Page %d
zh_hans: 第 %d 页
zh_hant: 第 %d 頁

# errors.ai.content_filtered
source: The request was blocked by the AI provider safety filter.
zh_hans: 请求被 AI 服务商的安全过滤器拦截。
zh_hant: 請求被 AI 服務商的安全過濾器攔截。

# errors.ai.service_unavailable
source: The AI service is temporarily unavailable.
zh_hans: AI 服务暂时不可用。
zh_hant: AI 服務暫時不可用。

# errors.ai.unsupported_capability
source: The selected AI provider does not support this capability.
zh_hans: 当前 AI 服务商不支持此能力。
zh_hant: 目前的 AI 服務商不支援此能力。

# errors.network.invalid_url
source: The request address is invalid.
zh_hans: 请求地址无效。
zh_hant: 請求位址無效。

# errors.network.decoding_failed
source: The server response could not be processed.
zh_hans: 无法处理服务器响应。
zh_hant: 無法處理伺服器回應。

# errors.notes.pdf.no_data
source: There are no notes to export.
zh_hans: 没有可导出的笔记。
zh_hant: 沒有可匯出的筆記。

# errors.notes.pdf.render_failed
source: Failed to render notes as a PDF.
zh_hans: 无法将笔记渲染为 PDF。
zh_hant: 無法將筆記渲染為 PDF。

# errors.notes.pdf.write_failed_format
source: Could not save the PDF file: %@
zh_hans: 无法保存 PDF 文件：%@
zh_hant: 無法儲存 PDF 檔案：%@

# errors.notes.pdf.unsupported_platform
source: PDF export is not supported on this platform.
zh_hans: 当前平台不支持导出 PDF。
zh_hant: 目前平台不支援匯出 PDF。

# errors.share.docx.read_failed
source: Could not read DOCX file.
zh_hans: 无法读取 DOCX 文件。
zh_hant: 無法讀取 DOCX 檔案。

# errors.share.docx.invalid_zip
source: File is not a valid ZIP archive.
zh_hans: 该文件不是有效的 ZIP 压缩包。
zh_hant: 此檔案不是有效的 ZIP 壓縮檔。

# errors.share.docx.document_xml_missing
source: word/document.xml was not found in the DOCX archive.
zh_hans: 在 DOCX 压缩包中找不到 word/document.xml。
zh_hant: 在 DOCX 壓縮檔中找不到 word/document.xml。

# errors.share.docx.inflate_failed
source: Failed to decompress word/document.xml.
zh_hans: 解压 word/document.xml 失败。
zh_hant: 解壓縮 word/document.xml 失敗。

# errors.share.docx.parse_failed_format
source: Failed to parse word/document.xml: %@
zh_hans: 解析 word/document.xml 失败：%@
zh_hant: 解析 word/document.xml 失敗：%@

# errors.ai.shortcut_unsupported_provider_format
source: Unsupported AI provider: %@
zh_hans: 不支持的 AI 提供商：%@
zh_hant: 不支援的 AI 供應商：%@

# errors.ai.shortcut_empty_response
source: The AI service returned an empty response.
zh_hans: AI 服务返回了空响应。
zh_hant: AI 服務回傳了空回應。

# errors.ai.shortcut_invalid_image
source: One of the selected images could not be processed.
zh_hans: 所选图片中有一张无法处理。
zh_hant: 所選圖片中有一張無法處理。

# errors.deeplink.missing_book_id
source: Missing bookId in deep link.
zh_hans: 深度链接中缺少 bookId。
zh_hant: 深度連結中缺少 bookId。

# errors.deeplink.invalid_book_id_format
source: Invalid bookId: %@
zh_hans: 无效的 bookId：%@
zh_hant: 無效的 bookId：%@

# errors.deeplink.book_not_found_format
source: Book #%lld not found.
zh_hans: 找不到图书 #%lld。
zh_hant: 找不到書籍 #%lld。

# errors.deeplink.invalid_locator_format
source: Invalid locator: %@
zh_hans: 无效的定位符：%@
zh_hant: 無效的定位符：%@

# ai.provider_picker.description.mini
source: Fast, cost-efficient everyday model.
zh_hans: 快速、经济，适合日常使用的模型。
zh_hant: 快速、經濟，適合日常使用的模型。

# ai.provider_picker.description.haiku
source: Claude's fastest model for quick tasks.
zh_hans: Claude 速度最快的模型，适合快速任务。
zh_hant: Claude 速度最快的模型，適合快速任務。

# ai.provider_picker.description.sonnet
source: Balanced intelligence and speed.
zh_hans: 在能力与速度之间取得平衡。
zh_hant: 在能力與速度之間取得平衡。

# ai.provider_picker.description.opus
source: Most capable, best for complex reasoning.
zh_hans: 能力最强，最适合复杂推理。
zh_hant: 能力最強，最適合複雜推理。

# ai.provider_picker.description.gpt41
source: OpenAI's flagship reasoning model.
zh_hans: OpenAI 的旗舰推理模型。
zh_hant: OpenAI 的旗艦推理模型。

# ai.provider_picker.description.gpt4o
source: Multimodal with strong vision skills.
zh_hans: 多模态模型，视觉能力强。
zh_hant: 多模態模型，視覺能力強。

# ai.provider_picker.description.default
source: General-purpose chat model.
zh_hans: 通用聊天模型。
zh_hant: 通用聊天模型。

# ai.providers.no_base_url
source: No base URL
zh_hans: 未设置 Base URL
zh_hant: 未設定 Base URL

# ai.tool_filter.safe
source: Safe
zh_hans: 安全
zh_hant: 安全

# ai.tool_filter.moderate
source: Moderate
zh_hans: 中等
zh_hant: 中等

# ai.tool_filter.dangerous
source: Dangerous
zh_hans: 危险
zh_hant: 危險

# ai.tool_category.book_library
source: Book Library
zh_hans: 书库
zh_hant: 書庫

# ai.tool_category.book_content
source: Book Content
zh_hans: 图书内容
zh_hant: 書籍內容

# ai.tool_category.annotation
source: Annotation
zh_hans: 标注
zh_hant: 標註

# ai.tool_category.reading_history
source: Reading History
zh_hans: 阅读记录
zh_hant: 閱讀記錄

# ai.tool_category.calendar
source: Calendar
zh_hans: 日历
zh_hant: 日曆

# ai.tool_category.reminders
source: Reminders
zh_hans: 提醒事项
zh_hant: 提醒事項

# ai.tool_category.utility
source: Utility
zh_hans: 实用工具
zh_hant: 實用工具

# ai.tool_category.agent
source: Agent
zh_hans: 智能体
zh_hant: 智能體

# ai.tool_category.mindmap
source: Mind Map
zh_hans: 思维导图
zh_hant: 思維導圖

# ai.image_analysis.default_prompt_value
source: Describe this image in detail. Highlight any text, diagrams, or notable elements.
zh_hans: 请详细描述这张图片，重点说明其中的文字、图表或其他值得注意的元素。
zh_hant: 請詳細描述這張圖片，重點說明其中的文字、圖表或其他值得注意的元素。

# ai.image_analysis.default_prompt
source: Default Prompt
zh_hans: 默认提示词
zh_hant: 預設提示詞

# ai.image_analysis.prompt_footer
source: Used as the system prompt when analysing an image without an explicit user prompt.
zh_hans: 在没有明确用户提示时，此提示词将作为图像分析的系统提示使用。
zh_hant: 在沒有明確使用者提示時，此提示詞將作為圖像分析的系統提示使用。

# ai.image_analysis.quality
source: Quality
zh_hans: 质量
zh_hant: 品質

# ai.image_analysis.max_image_size
source: Max Image Size
zh_hans: 最大图像尺寸
zh_hant: 最大影像尺寸

# ai.image_analysis.integrations
source: Integrations
zh_hans: 集成
zh_hant: 整合

# ai.image_analysis.enable_for_reader_images
source: Enable for Reader Images
zh_hans: 在阅读器图片中启用
zh_hant: 在閱讀器圖片中啟用

# ai.image_analysis.enable_for_highlights
source: Enable for Highlights
zh_hans: 在高亮中启用
zh_hant: 在螢光標示中啟用

# statistics.books_count_format
source: %d books
zh_hans: %d 本书
zh_hant: %d 本書

# statistics.average_completion
source: Avg Completion
zh_hans: 平均完成用时
zh_hant: 平均完成耗時

# statistics.average_completion_days_format
source: %.1f days
zh_hans: %.1f 天
zh_hant: %.1f 天

# statistics.day_count_format
source: %d days
zh_hans: %d 天
zh_hant: %d 天

# statistics.daily_goal
source: Daily
zh_hans: 每日
zh_hant: 每日

# statistics.goal_progress_minutes_format
source: %d/%d min
zh_hans: %d/%d 分钟
zh_hant: %d/%d 分鐘

# statistics.yearly_goal
source: Yearly
zh_hans: 年度
zh_hant: 年度

# kairos.goal_reached_body
source: Great job reaching your goal! Keep the streak going.
zh_hans: 做得很棒，你已达成今天的目标！继续保持连续记录吧。
zh_hant: 做得很棒，你已達成今天的目標！繼續保持連續紀錄吧。

# kairos.remaining_minutes_format
source: You have %d minutes left to reach your daily goal.
zh_hans: 距离达成今日目标还差 %d 分钟。
zh_hant: 距離達成今日目標還差 %d 分鐘。

# kairos.today_progress_format
source: %d / %d min
zh_hans: %d / %d 分钟
zh_hant: %d / %d 分鐘

# kairos.achievement.first_steps.title
source: First Steps
zh_hans: 初试身手
zh_hant: 初試身手

# kairos.achievement.first_steps.detail
source: Reach your daily goal once
zh_hans: 达成一次每日目标
zh_hant: 達成一次每日目標

# kairos.achievement.week_warrior.title
source: Week Warrior
zh_hans: 一周达人
zh_hant: 一週達人

# kairos.achievement.week_warrior.detail
source: 7-day reading streak
zh_hans: 连续阅读 7 天
zh_hant: 連續閱讀 7 天

# kairos.achievement.unstoppable.title
source: Unstoppable
zh_hans: 势不可挡
zh_hant: 勢不可擋

# kairos.achievement.unstoppable.detail
source: 30-day reading streak
zh_hans: 连续阅读 30 天
zh_hant: 連續閱讀 30 天

# ai.providers.custom_name_placeholder
source: e.g. My Provider
zh_hans: 例如：我的提供商
zh_hant: 例如：我的提供者

# ai.tool.builtin.current_time.name
source: Current Time
zh_hans: 当前时间
zh_hant: 目前時間

# ai.tool.builtin.current_time.description
source: Get the current device time in ISO-8601 format, Unix timestamp, and timezone name.
zh_hans: 获取当前设备时间，返回 ISO-8601 格式、Unix 时间戳和时区名称。
zh_hant: 取得目前裝置時間，回傳 ISO-8601 格式、Unix 時間戳與時區名稱。

# ai.tool.builtin.calculator.name
source: Calculator
zh_hans: 计算器
zh_hant: 計算機

# ai.tool.builtin.calculator.description
source: Evaluate arithmetic expressions. Supports +, -, *, /, and parentheses.
zh_hans: 计算算术表达式，支持 +、-、*、/ 和括号。
zh_hant: 計算算術表達式，支援 +、-、*、/ 與括號。

# ai.tool.builtin.fetch_url.name
source: Fetch URL
zh_hans: 获取网页内容
zh_hant: 取得網頁內容

# ai.tool.builtin.fetch_url.description
source: Fetch text content from an HTTP/HTTPS URL. Returns plain text (HTML stripped). Max 50KB.
zh_hans: 获取 HTTP/HTTPS URL 的文本内容，返回纯文本（会去除 HTML），最大 50KB。
zh_hant: 取得 HTTP/HTTPS URL 的文字內容，回傳純文字（會移除 HTML），上限 50KB。

# ai.tool.builtin.web_search.name
source: Web Search
zh_hans: 网页搜索
zh_hant: 網頁搜尋

# ai.tool.builtin.web_search.description
source: Search the web using Serper API. Returns top results with title, URL, snippet.
zh_hans: 使用 Serper API 搜索网页，返回标题、URL 和摘要。
zh_hant: 使用 Serper API 搜尋網頁，回傳標題、URL 與摘要。

# ai.tool.builtin.mindmap_draw.name
source: Draw Mind Map
zh_hans: 绘制思维导图
zh_hant: 繪製心智圖

# ai.tool.builtin.mindmap_draw.description
source: Transform a hierarchical bullet list into a mind map JSON structure for rendering.
zh_hans: 将层级项目列表转换为可渲染的思维导图 JSON 结构。
zh_hant: 將階層項目列表轉換為可渲染的心智圖 JSON 結構。

# ai.tool.builtin.tool_approval_decider.name
source: Tool Approval Decider
zh_hans: 工具审批判断
zh_hant: 工具審批判斷

# ai.tool.builtin.tool_approval_decider.description
source: Internal: decide if a pending tool call requires user approval based on risk level and tool category.
zh_hans: 内部工具：根据风险级别和工具分类判断是否需要用户审批。
zh_hant: 內部工具：根據風險等級與工具分類判斷是否需要使用者審批。

# ai.tool.builtin.bookshelf_lookup.name
source: Bookshelf Lookup
zh_hans: 书架查询
zh_hant: 書架查詢

# ai.tool.builtin.bookshelf_lookup.description
source: Find books on the user's local shelf by title, author, or group. Returns structured list with metadata and reading progress.
zh_hans: 按书名、作者或分组查找本地书架中的图书，返回结构化元数据和阅读进度。
zh_hant: 依書名、作者或分組查找本地書架中的圖書，回傳結構化中繼資料與閱讀進度。

# ai.tool.builtin.bookshelf_organize.name
source: Bookshelf Organize
zh_hans: 书架整理
zh_hant: 書架整理

# ai.tool.builtin.bookshelf_organize.description
source: Draft a bookshelf reorganization plan: moving books to groups, renaming groups. Returns a plan JSON; user must confirm before execution.
zh_hans: 生成书架整理方案，例如将图书移动到分组或重命名分组；返回计划 JSON，需用户确认后执行。
zh_hant: 產生書架整理方案，例如將圖書移到分組或重新命名分組；回傳計畫 JSON，需使用者確認後執行。

# ai.tool.builtin.books_tags_list.name
source: Books Tags List
zh_hans: 图书标签列表
zh_hant: 圖書標籤列表

# ai.tool.builtin.books_tags_list.description
source: List books with their associated tags. Optionally filtered by book IDs.
zh_hans: 列出图书及其关联标签，可按图书 ID 过滤。
zh_hant: 列出圖書及其關聯標籤，可依圖書 ID 篩選。

# ai.tool.builtin.tags_list.name
source: Tags List
zh_hans: 标签列表
zh_hant: 標籤列表

# ai.tool.builtin.tags_list.description
source: List all book tags with their ID, name, and color.
zh_hans: 列出所有图书标签及其 ID、名称和颜色。
zh_hant: 列出所有圖書標籤及其 ID、名稱與顏色。

# ai.tool.builtin.apply_book_tags.name
source: Apply Book Tags
zh_hans: 应用图书标签
zh_hant: 套用圖書標籤

# ai.tool.builtin.apply_book_tags.description
source: Apply or remove tags from books. Requires user confirmation.
zh_hans: 为图书应用或移除标签，需要用户确认。
zh_hant: 為圖書套用或移除標籤，需要使用者確認。

# ai.tool.builtin.current_reading_metadata.name
source: Current Reading Metadata
zh_hans: 当前阅读元数据
zh_hant: 目前閱讀中繼資料

# ai.tool.builtin.current_reading_metadata.description
source: Get metadata for the currently active reading session: book ID, title, progress percentage, and current chapter.
zh_hans: 获取当前阅读会话的元数据，如书籍 ID、标题、阅读进度百分比和当前章节。
zh_hant: 取得目前閱讀工作階段的中繼資料，例如書籍 ID、標題、閱讀進度百分比與目前章節。

# ai.tool.builtin.current_book_toc.name
source: Current Book TOC
zh_hans: 当前书籍目录
zh_hant: 目前書籍目錄

# ai.tool.builtin.current_book_toc.description
source: Retrieve the table of contents for the currently reading book.
zh_hans: 获取当前正在阅读书籍的目录。
zh_hant: 取得目前正在閱讀書籍的目錄。

# ai.tool.builtin.current_chapter_content.name
source: Current Chapter Content
zh_hans: 当前章节内容
zh_hant: 目前章節內容

# ai.tool.builtin.current_chapter_content.description
source: Get the plain-text content of the current chapter being read.
zh_hans: 获取当前正在阅读章节的纯文本内容。
zh_hant: 取得目前正在閱讀章節的純文字內容。

# ai.tool.builtin.current_book_fulltext.name
source: Current Book Full Text
zh_hans: 当前书籍全文
zh_hant: 目前書籍全文

# ai.tool.builtin.current_book_fulltext.description
source: Retrieve full text of the current book. Only use for short books (< 50K chars). Returns error for long books.
zh_hans: 获取当前书籍的全文，仅适用于较短书籍（少于 50K 字符）；过长会返回错误。
zh_hant: 取得目前書籍的全文，只適用於較短書籍（少於 50K 字元）；過長時會回傳錯誤。

# ai.tool.builtin.chapter_content_by_href.name
source: Chapter Content by Href
zh_hans: 按 href 获取章节内容
zh_hant: 依 href 取得章節內容

# ai.tool.builtin.chapter_content_by_href.description
source: Retrieve chapter content by TOC href identifier.
zh_hans: 根据目录 href 标识获取章节内容。
zh_hant: 根據目錄 href 識別碼取得章節內容。

# ai.tool.builtin.resolve_cfi.name
source: Resolve CFI
zh_hans: 解析 CFI
zh_hant: 解析 CFI

# ai.tool.builtin.resolve_cfi.description
source: Resolve an EPUB CFI locator string into chapter metadata (title, href).
zh_hans: 将 EPUB CFI 定位字符串解析为章节元数据（标题、href）。
zh_hant: 將 EPUB CFI 定位字串解析為章節中繼資料（標題、href）。

# ai.tool.builtin.book_content_search.name
source: Book Content Search
zh_hans: 书内全文搜索
zh_hant: 書內全文搜尋

# ai.tool.builtin.book_content_search.description
source: Full-text search within a specific book. Returns matching snippets with chapter context.
zh_hans: 在指定书籍内进行全文搜索，返回带章节上下文的匹配片段。
zh_hant: 在指定書籍內進行全文搜尋，回傳帶有章節脈絡的匹配片段。

# ai.tool.builtin.create_highlight.name
source: Create Highlight
zh_hans: 创建高亮
zh_hant: 建立劃線

# ai.tool.builtin.create_highlight.description
source: Create a highlight annotation at a book position. Color options: yellow, green, blue, red, purple.
zh_hans: 在书籍位置创建高亮标注，可选颜色：黄、绿、蓝、红、紫。
zh_hant: 在書籍位置建立劃線標註，可選顏色：黃、綠、藍、紅、紫。

# ai.tool.builtin.create_note.name
source: Create Note
zh_hans: 创建笔记
zh_hant: 建立筆記

# ai.tool.builtin.create_note.description
source: Create a text note (bookmark-type annotation) at a book position.
zh_hans: 在书籍位置创建文本笔记（书签类型标注）。
zh_hant: 在書籍位置建立文字筆記（書籤型標註）。

# ai.tool.builtin.notes_search.name
source: Notes Search
zh_hans: 笔记搜索
zh_hant: 筆記搜尋
